# Homebrew bundle (run: brew bundle)

tap "aws/tap"
tap "hashicorp/tap"
tap "terraform-docs/tap"

# Shell + basics
brew "coreutils"
brew "bash"
brew "bash-completion@2"

# GPG
brew "gnupg"
brew "pinentry-mac"

# Editors/tools
brew "emacs"
brew "jq"
brew "nmap"
brew "wget"
brew "siege"
brew "grep"
brew "openssh"
brew "screen"
brew "tree"

# Cloud/Kubernetes
brew "awscli"
brew "ansible"
brew "git"
brew "node"
brew "cfn-lint"
brew "tflint"
brew "eksctl"
brew "helm"
brew "k9s"
brew "kubernetes-cli"      # kubectl
brew "openshift-cli"       # oc

# cl helper depends on Granted/assume
brew "granted"

# Tapped formulae
brew "aws/tap/aws-sam-cli"
brew "hashicorp/tap/terraform"
brew "terraform-docs/tap/terraform-docs"

# Casks
cask "zen"
